app/views/articles/index.html.erb

SELECT  "revisions".* FROM "revisions" WHERE "revisions"."article_id" = $1  ORDER BY "revisions"."id" DESC LIMIT 1  [["article_id", 14]]
---
          <%= image_tag(article.img_src, size: "150")  %>
          <h3> <%= link_to(article.title, :controller => "revisions", :action => "show", article_id: article.id, id: article.revisions.last.id) %></h3>