app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  ORDER BY "articles"."id" DESC LIMIT 5
---
  def index
    @articles = Article.last(5).reverse