app/controllers/revisions_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    @article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "revisions" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "<p>PLEASE WORK</p>\r\n"], ["user_id", 1], ["article_id", 1], ["created_at", "2016-05-04 23:13:07.032124"], ["updated_at", "2016-05-04 23:13:07.032124"]]
---
  def create
    @article = Article.find(params[:id])
    @revision = @article.revisions.new(body: params[:body], user_id: @article.creator.id)
    if @revision.save