app/views/categories/show.html.erb

SELECT  "revisions".* FROM "revisions" WHERE "revisions"."article_id" = $1  ORDER BY "revisions"."id" DESC LIMIT 1  [["article_id", 1]]
---
  <h3> <%= link_to(article.title, article_path(article)) %></h3>
  <p class="featured-article-snippet"> <%= raw article.revisions.last.body.split(".")[0..1].join(". ") %>...</p>